'use strict';
// -------------------------------------
let resultat = '';

for( let i = 10; i <= 20; i++ ){
resultat += i;
if(i < 20){
    resultat += ',';
}
}
console.log(`Вивести на сторінку в один рядок через кому числа від 10 до 20: ${resultat}`);

// ---------------------------------------------------------------------------------------------
let resultat2 = '';

for( let i = 10; i <= 20; i++ ){
resultat2 += i * i;
if(i < 20){
    resultat2 += ',';
}
}
console.log(`Вивести квадрати чисел від 10 до 20. 
${resultat2}`);
// =====================================================================================================
for  ( let i = 1; i <= 7; i++){
    console.log(`7 * ${i} = ${7 * i} `);
}
// ========================================================================
let sum = 0;

for(let i = 0; i <= 15; i++){
    sum += i;
    console.log(`Сума чисел 1 і 15: ${sum}`);
}
// ============================================================================
let sum2 = 1;
for(let i = 15; i <= 35; i++){
    sum2 *= i ;
    console.log(`Добуток чисел 1 і 15: ${sum2}`);
}
// ===================================================================
let sum3 = 0;
let count = 0;
for( let i = 0; i <= 500; i++){
    sum3 += i;
    count++;
    const average = count / sum3;

    console.log(`Середне значення між 1 та 500: ${average}`);
}
// =======================================================================
let sum4 = 0;

for(let i = 30; i <= 80; i++){
    if(i%2 ===0){
        sum4 += i;
        console.log(`Сума парних чисел: ${sum4}`);
    }
    
}
// ======================================================================
for (let i = 100; i <= 200; i++) {
    if (i % 3 === 0) {
        console.log(`Кртані цифри 3м: ${i}`);
    }
}
// ========================================================================
let sum5 = 24;
let quantityNubmer5 = 0;
let sumNumber5 = 0;
for(let i = 1; i <= 24; i++){
    if(24 % i === 0 ){
        console.log(`Всі дільники числа: ${i}`);
        if(i % 2 === 0){
            quantityNubmer5++;
            sumNumber5 += i;
        }
    }  
    console.log(`
    Кол-во парних лічільників: ${quantityNubmer5}
    Сума парних лічільників: ${sumNumber5}`)
}
// =========================================================================
for( let i = 1; i <= 10; i++){
    for( let b = 1 ; b <= 10; b++){
     console.log(`Таблиця множення:
     ${i}*${b} = ${i * b}`)
    }
}